In [49]:
import pandas as pd

In [50]:
path = '../../pandas-workout-data/data/oecd_locations.csv' 
df_oecd = pd.read_csv(filepath_or_buffer=path, header=None, names=['abbrev','country'], index_col='abbrev')
df_oecd

               country
abbrev
AUS          Australia
AUT            Austria
BEL            Belgium
CAN             Canada
DNK            Denmark
FIN            Finland
FRA             France
DEU            Germany
HUN            Hungary
ITA              Italy
JPN              Japan
KOR              Korea
GBR     United Kingdom
USA      United States
BRA             Brazil
ISR             Israel

In [51]:
path = '../../pandas-workout-data/data/oecd_tourism.csv'
columns_oecd_tourism = ['LOCATION', 'TIME', 'SUBJECT', 'Value']
oecd_tourism_df  = pd.read_csv(filepath_or_buffer=path, usecols=columns_oecd_tourism, index_col='LOCATION')
oecd_tourism_df

          SUBJECT  TIME      Value
LOCATION
AUS       INT_REC  2008  31159.800
AUS       INT_REC  2009  29980.700
AUS       INT_REC  2010  35165.500
AUS       INT_REC  2011  38710.100
AUS       INT_REC  2012  38003.700
...           ...   ...        ...
SRB       INT-EXP  2015   1253.644
SRB       INT-EXP  2016   1351.098
SRB       INT-EXP  2017   1549.183
SRB       INT-EXP  2018   1837.317
SRB       INT-EXP  2019   1999.313

[1234 rows x 3 columns]

In [52]:
oecd_tourism_df  = oecd_tourism_df .loc[oecd_tourism_df ['SUBJECT'] == 'INT-EXP'].copy()
oecd_tourism_df  = oecd_tourism_df .drop('SUBJECT', axis=1)

In [53]:
oecd_tourism_df

          TIME      Value
LOCATION
AUS       2008  27620.000
AUS       2009  25629.600
AUS       2010  31916.500
AUS       2011  39381.500
AUS       2012  41632.800
...        ...        ...
SRB       2015   1253.644
SRB       2016   1351.098
SRB       2017   1549.183
SRB       2018   1837.317
SRB       2019   1999.313

[617 rows x 2 columns]

Create a new series, ``tourism_spending``, in which the index reflects the country names (i.e., not abbreviations) and the value contains the average tourism spending for that country.

In [67]:
series_mean_country = oecd_tourism_df.groupby('LOCATION')['Value'].mean()
series_mean_country.head(5)

LOCATION
AUS    36727.966667
AUT    11934.563636
BEL    20859.883455
BGR     1562.641750
BRA    21564.351833
Name: Value, dtype: float64

In [72]:
mean_tourism_spending = df_oecd.join(series_mean_country).reset_index().set_index('country')
del mean_tourism_spending['abbrev']
mean_tourism_spending

                        Value
country
Australia        36727.966667
Austria          11934.563636
Belgium          20859.883455
Canada           40984.633333
Denmark          11326.169636
Finland           5877.080909
France           51394.272273
Germany          96615.075545
Hungary           2918.390182
Italy            34148.908455
Japan            32197.925000
Korea            25573.509091
United Kingdom   75262.227273
United States   142080.666667
Brazil           21564.351833
Israel            6726.524833

Create a third data frame, ``wine_df``, based on winemag-150k-reviews.csv. You only need two columns: ``country`` and ``points``.

In [57]:
path = '../../pandas-workout-data/data/winemag-150k-reviews.csv'
columns = ['country', 'points']
wide_df = pd.read_csv(filepath_or_buffer=path, usecols=columns)
wide_df.head(5)

  country  points
0      US      96
1   Spain      96
2      US      96
3      US      96
4  France      95

Get the mean wine score for each country, across all wine reviews, sorted in descending order.

In [79]:
mean_wine_score_country = wide_df.groupby('country')['points'].mean().sort_values(ascending=False)
mean_wine_score_country.head(5)
# mean_wine_score_country.name = 'Value'
# mean_wine_score_country

country
England    92.888889
Austria    89.276742
France     88.925870
Germany    88.626427
Italy      88.413664
Name: points, dtype: float64

Perform a standard join between the average wine scores per country and the average tourism spending per country. Where do you see NaN values? What do those NaN values mean?

In [59]:
mean_tourism_spending.head(2)

                  Value
country
Australia  36727.966667
Austria    11934.563636

In [71]:
mean_wine_score_country.head(2)

country
England    92.888889
Austria    89.276742
Name: points, dtype: float64

In [80]:
df = mean_tourism_spending.join(mean_wine_score_country, lsuffix='-left-side', rsuffix='-right-side')
df

                        Value     points
country
Australia        36727.966667  87.892475
Austria          11934.563636  89.276742
Belgium          20859.883455        NaN
Canada           40984.633333  88.239796
Denmark          11326.169636        NaN
Finland           5877.080909        NaN
France           51394.272273  88.925870
Germany          96615.075545  88.626427
Hungary           2918.390182  87.329004
Italy            34148.908455  88.413664
Japan            32197.925000  85.000000
Korea            25573.509091        NaN
United Kingdom   75262.227273        NaN
United States   142080.666667        NaN
Brazil           21564.351833  83.240000
Israel            6726.524833  87.176190

In [82]:
df_2 = mean_wine_score_country.to_frame().join(mean_tourism_spending)
df_2.sort_index()
# we didn’t have tourism information (in the right side’s index)

                           points         Value
country
Albania                 88.000000           NaN
Argentina               85.996093           NaN
Australia               87.892475  36727.966667
Austria                 89.276742  11934.563636
Bosnia and Herzegovina  84.750000           NaN
Brazil                  83.240000  21564.351833
Bulgaria                85.467532           NaN
Canada                  88.239796  40984.633333
Chile                   86.296768           NaN
China                   82.000000           NaN
Croatia                 86.280899           NaN
Cyprus                  85.870968           NaN
Czech Republic          85.833333           NaN
Egypt                   83.666667           NaN
England                 92.888889           NaN
France                  88.925870  51394.272273
Georgia                 85.511628           NaN
Germany                 88.626427  96615.075545
Greece                  86.117647           NaN
Hungary                 87.329004   2918.390182
India                   87.625000           NaN
Israel                  87.176190   6726.524833
Italy                   88.413664  34148.908455
Japan                   85.000000  32197.925000
Lebanon                 85.702703           NaN
Lithuania               84.250000           NaN
Luxembourg              87.000000           NaN
Macedonia               84.812500           NaN
Mexico                  84.761905           NaN
Moldova                 84.718310           NaN
Montenegro              82.000000           NaN
Morocco                 88.166667           NaN
New Zealand             87.554217           NaN
Portugal                88.057685           NaN
Romania                 84.920863           NaN
Serbia                  87.714286           NaN
Slovakia                83.666667           NaN
Slovenia                88.234043           NaN
South Africa            87.225421           NaN
South Korea             81.500000           NaN
Spain                   86.646589           NaN
Switzerland             87.250000           NaN
Tunisia                 86.000000           NaN
Turkey                  88.096154           NaN
US                      87.818789           NaN
US-France               88.000000           NaN
Ukraine                 84.600000           NaN
Uruguay                 84.478261           NaN

Perform an outer join between the average wine scores per country and the average tourism spending per country. Where do you see NaN values? What do they mean now?

In [83]:
df_3 = mean_tourism_spending.join(mean_wine_score_country, how='outer')
df_3
# The output frame’s index is the combination of the left’s index and the right’s index.
# We may thus end up with NaN values in columns from both the left and right, depending on which index value was missing

                                Value     points
country
Albania                           NaN  88.000000
Argentina                         NaN  85.996093
Australia                36727.966667  87.892475
Austria                  11934.563636  89.276742
Belgium                  20859.883455        NaN
Bosnia and Herzegovina            NaN  84.750000
Brazil                   21564.351833  83.240000
Bulgaria                          NaN  85.467532
Canada                   40984.633333  88.239796
Chile                             NaN  86.296768
China                             NaN  82.000000
Croatia                           NaN  86.280899
Cyprus                            NaN  85.870968
Czech Republic                    NaN  85.833333
Denmark                  11326.169636        NaN
Egypt                             NaN  83.666667
England                           NaN  92.888889
Finland                   5877.080909        NaN
France                   51394.272273  88.925870
Georgia                           NaN  85.511628
Germany                  96615.075545  88.626427
Greece                            NaN  86.117647
Hungary                   2918.390182  87.329004
India                             NaN  87.625000
Israel                    6726.524833  87.176190
Italy                    34148.908455  88.413664
Japan                    32197.925000  85.000000
Korea                    25573.509091        NaN
Lebanon                           NaN  85.702703
Lithuania                         NaN  84.250000
Luxembourg                        NaN  87.000000
Macedonia                         NaN  84.812500
Mexico                            NaN  84.761905
Moldova                           NaN  84.718310
Montenegro                        NaN  82.000000
Morocco                           NaN  88.166667
New Zealand                       NaN  87.554217
Portugal                          NaN  88.057685
Romania                           NaN  84.920863
Serbia                            NaN  87.714286
Slovakia                          NaN  83.666667
Slovenia                          NaN  88.234043
South Africa                      NaN  87.225421
South Korea                       NaN  81.500000
Spain                             NaN  86.646589
Switzerland                       NaN  87.250000
Tunisia                           NaN  86.000000
Turkey                            NaN  88.096154
US                                NaN  87.818789
US-France                         NaN  88.000000
Ukraine                           NaN  84.600000
United Kingdom           75262.227273        NaN
United States           142080.666667        NaN
Uruguay                           NaN  84.478261

In [64]:
df_3 = mean_wine_score_country.to_frame().join(mean_tourism_spending, how='outer')
df_3

                           points          Value
country
Albania                 88.000000            NaN
Argentina               85.996093            NaN
Australia               87.892475   36727.966667
Austria                 89.276742   11934.563636
Belgium                       NaN   20859.883455
Bosnia and Herzegovina  84.750000            NaN
Brazil                  83.240000   21564.351833
Bulgaria                85.467532            NaN
Canada                  88.239796   40984.633333
Chile                   86.296768            NaN
China                   82.000000            NaN
Croatia                 86.280899            NaN
Cyprus                  85.870968            NaN
Czech Republic          85.833333            NaN
Denmark                       NaN   11326.169636
Egypt                   83.666667            NaN
England                 92.888889            NaN
Finland                       NaN    5877.080909
France                  88.925870   51394.272273
Georgia                 85.511628            NaN
Germany                 88.626427   96615.075545
Greece                  86.117647            NaN
Hungary                 87.329004    2918.390182
India                   87.625000            NaN
Israel                  87.176190    6726.524833
Italy                   88.413664   34148.908455
Japan                   85.000000   32197.925000
Korea                         NaN   25573.509091
Lebanon                 85.702703            NaN
Lithuania               84.250000            NaN
Luxembourg              87.000000            NaN
Macedonia               84.812500            NaN
Mexico                  84.761905            NaN
Moldova                 84.718310            NaN
Montenegro              82.000000            NaN
Morocco                 88.166667            NaN
New Zealand             87.554217            NaN
Portugal                88.057685            NaN
Romania                 84.920863            NaN
Serbia                  87.714286            NaN
Slovakia                83.666667            NaN
Slovenia                88.234043            NaN
South Africa            87.225421            NaN
South Korea             81.500000            NaN
Spain                   86.646589            NaN
Switzerland             87.250000            NaN
Tunisia                 86.000000            NaN
Turkey                  88.096154            NaN
US                      87.818789            NaN
US-France               88.000000            NaN
Ukraine                 84.600000            NaN
United Kingdom                NaN   75262.227273
United States                 NaN  142080.666667
Uruguay                 84.478261            NaN

Find the correlation between average wine score and average tourism spending. What can you say about these two values? Is there any correlation?

In [65]:
df.sort_values('Value')

                        Value     points
country
Hungary           2918.390182  87.329004
Finland           5877.080909        NaN
Israel            6726.524833  87.176190
Denmark          11326.169636        NaN
Austria          11934.563636  89.276742
Belgium          20859.883455        NaN
Brazil           21564.351833  83.240000
Korea            25573.509091        NaN
Japan            32197.925000  85.000000
Italy            34148.908455  88.413664
Australia        36727.966667  87.892475
Canada           40984.633333  88.239796
France           51394.272273  88.925870
United Kingdom   75262.227273        NaN
Germany          96615.075545  88.626427
United States   142080.666667        NaN

In [86]:
mean_tourism_spending.join(
    mean_wine_score_country, how='outer'
).corr()

           Value    points
Value   1.000000  0.288231
points  0.288231  1.000000

In [87]:
"""We get 0.288, which points to a weak positive correlation between the two.
So yes, countries that spend more on tourism are more likely to have highly rated wines"""

'We get 0.288, which points to a weak positive correlation between the two.\nSo yes, countries that spend more on tourism are more likely to have highly rated wines'